Revit 2027 API
FabricationRodInfo.SetBearerExtension Method
 Sets the bearer extension. The method is applicable only for bearer hanger.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetBearerExtension(
	int rodIndex,
	double length
)
Public Sub SetBearerExtension (
	rodIndex As Integer,
	length As Double
)
public:
void SetBearerExtension(
	int rodIndex,
	double length
)
member SetBearerExtension :
        rodIndex : int *
        length : float -> unit
Parameters
rodIndex Int32
 The index of the rod.
length Double
 The new length of bearer extension.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  the index rodIndex is should be in range of rod count.
InvalidOperationException |  The hanger is not a bearer hanger.
See Also
Reference
FabricationRodInfo Class
Autodesk.Revit.DB Namespace